Tutorials/Tutorial_case_1_flap_finer_str_mesh/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    squareblock
    {
        type            noSlip;
    }

    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    top
    {
        type            slip;

    }

    bottom
    {
        type            slip;
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant (51.3 0 0);

    }

    outlet
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
