Tutorials/Tutorial_case_1_flap_finer_str_mesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          15080;
        startFace       29769;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          15080;
        startFace       44849;
    }
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       59929;
    }
    outlet
    {
        type            patch;
        nFaces          81;
        startFace       59989;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          190;
        startFace       60070;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          190;
        startFace       60260;
    }
    flap
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          161;
        startFace       60450;
    }
    squareblock
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       60611;
    }
)

// ************************************************************************* //
