Tutorials/Tutorial_case_1_flap_finer_str_mesh/system/decomposeParDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    numberOfSubdomains 2;

    method hierarchical;
    hierarchicalCoeffs
    {
        n (2 1 1);
        delta 0.001; //Cell Skew Factor
        order xyz;   //Order of decomposition
    }

    distributed false;
    roots
    (
    );


